Repository: XOlegator/fresh
Catalog: docs/source/locale/*/LC_MESSAGES/manual.po
Languages: ru

source: Manual
ru: Документация

source: There is /docs/source directory with user manual source files. Those files are compile to endpoint user manual by the help shell command (from the root directory of the project at stand alone terminal):
ru: В каталоге /docs/source directory находится исходный код документации. Эти файлы компилируются в конечный вид документации с помощью команды в терминале (запускается в корневом каталоге проекта в отдельном окне терминала):

source: The compiled docs you can open in browser fresh/docs/build/html/index.html
ru: Скомпилированную документацию можно увидеть в браузере, запустив fresh/docs/build/html/index.html

source: Documentation translation workflow
ru: Процесс перевода документации

source: These instructions are taken from the website http://www.sphinx-doc.org/en/master/intl.html.
ru: Эта инструкция заимствована с сайта http://www.sphinx-doc.org/en/master/intl.html.

source: `sphinx-intl`_ is a useful tool to work with Sphinx translation flow. This section describe an easy way to translate with sphinx-intl.
ru: `sphinx-intl`_ это полезная утилита для работы по переводу в Sphinx. Этот раздел описывает простой способ процесса перевода с утилитой sphinx-intl.

source: Install `sphinx-intl`_ by :command:`pip install sphinx-intl` or :command:`easy_install sphinx-intl`.
ru: Установите `sphinx-intl`_ с помощью команды :command:`pip install sphinx-intl` или :command:`easy_install sphinx-intl`.

source: Add configurations to your `conf.py`::
ru: Добавить параметры настройки `conf.py`::

source: This case-study assumes that `locale_dirs` is set to 'locale/' and `gettext_compact` is set to `False` (the Sphinx document is already configured as such).
ru: Этот сценарий подразумевает, что настройка `locale_dirs` установлена значением 'locale/' и `gettext_compact` установлена в `False` (эта Sphinx документация уже сконфигурирована должным образом).

source: Extract document's translatable messages into pot files:
ru: Извлечь сообщения для перевода из текстов в pot файлы:

source: Setup/Update your `locale_dir`:
ru: Создание/обновление каталога `locale_dir`:

source: Done. You got these directories that contain po files:
ru: Готово. Вы получите каталоги, содержащие po файлы:

source: Translate your po files under `./locale/<lang>/LC_MESSAGES/`.
ru: Переведите ваши po файлы в каталоге `./locale/<lang>/LC_MESSAGES/`.

source: You need a `language` parameter in ``conf.py`` or you may also specify the parameter on the command line (for BSD/GNU make):
ru: Необходимо задать параметр `language` в конфиге ``conf.py`` или можно установить параметр в командной строке (для команды BSD/GNU make):

source: command line (for Windows cmd.exe):
ru: команда (для Windows cmd.exe):

source: command line (for PowerShell):
ru: команда (для PowerShell):

source: Congratulations! You got the translated documentation in the ``build/html`` directory.
ru: Поздравляем! Вы получили переведённую документацию в каталоге ``build/html``.
